Infineon/AURIX_code_examples/code_examples/TC29xTP_BC-step/Project2/Libraries/Infra/Sfr/TC29B/_Reg/IfxQspi_bf.h
/** \brief  Mask for Ifx_QSPI_STATUS_Bits.RXFIFOLEVEL */
#define IFX_QSPI_STATUS_RXFIFOLEVEL_MSK (0x7u)

/** \brief  Offset for Ifx_QSPI_STATUS_Bits.RXFIFOLEVEL */
#define IFX_QSPI_STATUS_RXFIFOLEVEL_OFF (19u)

/** \brief  Length for Ifx_QSPI_STATUS_Bits.SLAVESEL */
#define IFX_QSPI_STATUS_SLAVESEL_LEN (4u)

/** \brief  Mask for Ifx_QSPI_STATUS_Bits.SLAVESEL */
#define IFX_QSPI_STATUS_SLAVESEL_MSK (0xfu)

/** \brief  Offset for Ifx_QSPI_STATUS_Bits.SLAVESEL */
#define IFX_QSPI_STATUS_SLAVESEL_OFF (22u)

/** \brief  Length for Ifx_QSPI_STATUS_Bits.TPV */
#define IFX_QSPI_STATUS_TPV_LEN (1u)

/** \brief  Mask for Ifx_QSPI_STATUS_Bits.TPV */
#define IFX_QSPI_STATUS_TPV_MSK (0x1u)

/** \brief  Offset for Ifx_QSPI_STATUS_Bits.TPV */
#define IFX_QSPI_STATUS_TPV_OFF (27u)

/** \brief  Length for Ifx_QSPI_STATUS_Bits.TXF */
#define IFX_QSPI_STATUS_TXF_LEN (1u)

/** \brief  Mask for Ifx_QSPI_STATUS_Bits.TXF */
#define IFX_QSPI_STATUS_TXF_MSK (0x1u)

/** \brief  Offset for Ifx_QSPI_STATUS_Bits.TXF */
#define IFX_QSPI_STATUS_TXF_OFF (9u)

/** \brief  Length for Ifx_QSPI_STATUS_Bits.TXFIFOLEVEL */
#define IFX_QSPI_STATUS_TXFIFOLEVEL_LEN (3u)

/** \brief  Mask for Ifx_QSPI_STATUS_Bits.TXFIFOLEVEL */
#define IFX_QSPI_STATUS_TXFIFOLEVEL_MSK (0x7u)

/** \brief  Offset for Ifx_QSPI_STATUS_Bits.TXFIFOLEVEL */
#define IFX_QSPI_STATUS_TXFIFOLEVEL_OFF (16u)

/** \brief  Length for Ifx_QSPI_STATUS_Bits.USRF */
#define IFX_QSPI_STATUS_USRF_LEN (1u)

/** \brief  Mask for Ifx_QSPI_STATUS_Bits.USRF */
#define IFX_QSPI_STATUS_USRF_MSK (0x1u)

/** \brief  Offset for Ifx_QSPI_STATUS_Bits.USRF */
#define IFX_QSPI_STATUS_USRF_OFF (15u)

/** \brief  Length for Ifx_QSPI_XXLCON_Bits.BYTECOUNT */
#define IFX_QSPI_XXLCON_BYTECOUNT_LEN (16u)

/** \brief  Mask for Ifx_QSPI_XXLCON_Bits.BYTECOUNT */
#define IFX_QSPI_XXLCON_BYTECOUNT_MSK (0xffffu)

/** \brief  Offset for Ifx_QSPI_XXLCON_Bits.BYTECOUNT */
#define IFX_QSPI_XXLCON_BYTECOUNT_OFF (16u)

/** \brief  Length for Ifx_QSPI_XXLCON_Bits.XDL */
#define IFX_QSPI_XXLCON_XDL_LEN (16u)

/** \brief  Mask for Ifx_QSPI_XXLCON_Bits.XDL */
#define IFX_QSPI_XXLCON_XDL_MSK (0xffffu)

/** \brief  Offset for Ifx_QSPI_XXLCON_Bits.XDL */
#define IFX_QSPI_XXLCON_XDL_OFF (0u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXQSPI_BF_H */
